Задание 1
Дана переменная, в которой хранится слово из латинских букв. Напишите код, который выводит на экран:

slovo = 'texter' 

if len(slovo) % 2 == 0:
    print(slovo[int((len(slovo) / 2)-1)],slovo[int(len(slovo) / 2)],sep="")
else:
    print(slovo[int(len(slovo) / 2)])


Задание 2
Напишите программу, которая последовательно запрашивает у пользователя числа (по одному за раз) и после первого нуля выводит сумму всех ранее введенных чисел.
sum_ = 0

while True:
    user_input = int(input('Введите число:'))
    if user_input != 0:
        pass
    else:
        print(sum_)
        break
    sum_ += user_input  

Задание 3
Мы делаем MVP dating-сервиса, и у нас есть список парней и девушек.
Выдвигаем гипотезу: лучшие рекомендации мы получим, если просто отсортируем имена по алфавиту и познакомим людей с одинаковыми индексами после сортировки! Но мы не будем никого знакомить, если кто-то может остаться без пары:

boys = ['Peter', 'Alex', 'John', 'Arthur', 'Richard']
girls = ['Kate', 'Liza', 'Kira', 'Emma', 'Trisha']

if len(boys) == len(girls):
    for boy, girl in zip (sorted(boys), sorted(girls)):    
        print(boy, 'и', girl)
else:
    print('Внимание, кто-то может остаться без пары!')

Задание 4
У нас есть список, содержащий информацию о среднедневной температуре в Фаренгейтах за произвольный период по странам (структура данных в примере). Необходимо написать код, который рассчитает среднюю температуру за период в Цельсиях(!) для каждой страны.
countries_temperature = [
['Thailand', [75.2, 77, 78.8, 73.4, 68, 75.2, 77]],
['Germany', [57.2, 55.4, 59, 59, 53.6]],
['Russia', [35.6, 37.4, 39.2, 41, 42.8, 39.2, 35.6]],
['Poland', [50, 50, 53.6, 57.2, 55.4, 55.4]]
]

print('Средняя температура в странах:')
for temp in countries_temperature:
         print(temp[0], round(((sum(temp[1])/len(temp[1]))-32)/1.8,1),'C')

Необходимо у пользователя запрашивать набор чисел разделенных пробелом. В результате должны выводиться числа, которые повторяются в вводе более одного раза.
new = []
vvod = input('Введите числа: ')

for unic in vvod:
    if unic not in new:
        new.append(unic)
        str = ''.join(new)
         
print('Результат:', str, '')

у меня также убираются пробелы. я не знаю, каr с этим бороться. 
